Revit 2027 API
ParameterTypeId.StructuralAttachmentStartValueDistance Property
 "Start Attachment Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentStartValueDistance { get; }
Public Shared ReadOnly Property StructuralAttachmentStartValueDistance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentStartValueDistance {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentStartValueDistance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace